Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionCannotReplaceRefs Property
 Structural Connection cannot replace elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralConnectionCannotReplaceRefs { get; }
Public Shared ReadOnly Property StructuralConnectionCannotReplaceRefs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralConnectionCannotReplaceRefs {
	FailureDefinitionId^ get ();
}
static member StructuralConnectionCannotReplaceRefs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace